Documents/ОбращениеВСтационар.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОбращениеВСтационар</Name>
			<BasedOn>
				<xr:Item>Document.Прием</xr:Item>
				<xr:Item>Document.БронированиеКойкоМеста</xr:Item>
				<xr:Item>Document.Заявка</xr:Item>
				<xr:Item>Document.ОказаниеУслуг</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедицинскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛечащийВрач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправившееУчреждение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиагнозНаправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиагнозПоступления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьДоставленСкоройПомощью</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставленПоЭкстреннымПоказателям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧерезЧасовПослеНачалаЗаболевания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаГоспитализации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщитьРодственникам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказВГоспитализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказаВГоспитализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.удалитьПричиныОтказаВГоспитализации</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйПовторныйОтказ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтказаВГоспитализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяОтказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятыеМеры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рекомендации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНаправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачиНаправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналГоспитализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыГоспитализации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНаряда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлкогольноеОпьянение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаркотическоеОпьянение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяГоспитализации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникЗафиксировавшийОтказ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказЗаконныйПредставитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпьянениеДатаВремяВзятияПробы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпьянениеРезультатВзятияПробы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяИнформированияЗП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторноеПоступление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтационараНаправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтационара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КлиентыСтационара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КлиентыСтационара</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КойкоМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КойкоМеста</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выписан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаУсловийПребывания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПолФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПолФизическихЛиц</Name>
			<Comment>Пол физических лиц</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеУказан</Name>
					<Comment>Пол не указан</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
					<Comment>Пол мужской</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
					<Comment>Пол женский</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыСтационара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыСтационара</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дневной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Круглосуточный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОбращениеВСтационар/Ext/ManagerModule.bsl
// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("ОтказПациентаОтГоспитализации","Отказ пациента от госпитализации");
	СтруктураМакетов.Вставить("ОтказВГоспитализации","Отказ в госпитализации");
	СтруктураМакетов.Вставить("ВыпискаИзМедкарты","Выписка форма №027/у"); 

	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура формирует печатную форму документа
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Функция Печать(СсылкаНаОбъект, ИмяМакета) Экспорт
	
Перем ТабДокумент;
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "ОтказВГоспитализации" Тогда
		ТабДокумент = ПечатьОтказВГоспитализации(СсылкаНаОбъект);
	ИначеЕсли ИмяМакета = "ВыпискаИзМедкарты" Тогда
		ТабДокумент = ПечатьВыпискаИзМедкарты(СсылкаНаОбъект);
	ИначеЕсли ИмяМакета = "ОтказПациентаОтГоспитализации" Тогда
		ТабДокумент = ПечатьОтказПациентаОтГоспитализации(СсылкаНаОбъект);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатьОтказВГоспитализации(СсылкаНаОбъект)  Экспорт
	
	Если Ложь Тогда СсылкаНаОбъект = Документы.ОбращениеВСтационар.ПустаяСсылка() КонецЕсли;
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ОтказВГоспитализации");
	ОбластьДокумент = Макет.ПолучитьОбласть("ОтказВГоспитализации");
	Если СсылкаНаОбъект.ОтказВГоспитализации Тогда 
		
		//Данные организации
		СтруктураРеквизитовОрганизации = ПроцедурыСпециализацииПоставки.ПолучитьРеквизитыОрганизации(СсылкаНаОбъект); 
		Если ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.НазваниеОрганизации) Тогда
			ОбластьДокумент.Параметры.НазваниеОрганизации = СтруктураРеквизитовОрганизации.НазваниеОрганизации;
		КонецЕсли;

		Если ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.Адрес) Тогда
			ОбластьДокумент.Параметры.АдресОрганизации = СтруктураРеквизитовОрганизации.Адрес;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.ИНН) И
			 ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.КПП)
		Тогда
			ОбластьДокумент.Параметры.ИННКПП = "ИНН: " + СтруктураРеквизитовОрганизации.ИНН + ", КПП: " + СтруктураРеквизитовОрганизации.КПП; 
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.Телефон) Тогда
			ОбластьДокумент.Параметры.Телефон = СтруктураРеквизитовОрганизации.Телефон;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.Телефон) Тогда
			ОбластьДокумент.Параметры.Телефон = СтруктураРеквизитовОрганизации.Телефон;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.ОГРН) Тогда
			ОбластьДокумент.Параметры.ОГРН = СтруктураРеквизитовОрганизации.ОГРН;
		КонецЕсли;
		
		ЗапросНомер = Новый Запрос("ВЫБРАТЬ
		                           |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбращениеВСтационар.Ссылка) КАК КоличествоОбращений
		                           |ИЗ
		                           |	Документ.ОбращениеВСтационар КАК ОбращениеВСтационар
		                           |ГДЕ
		                           |	ОбращениеВСтационар.Ссылка <> &Ссылка
		                           |	И ОбращениеВСтационар.ОтказВГоспитализации");
		ЗапросНомер.УстановитьПараметр("Ссылка",СсылкаНаОбъект);
		ВыборкаНомер = ЗапросНомер.Выполнить().Выбрать();
		ВыборкаНомер.Следующий();
		
		ОбластьДокумент.Параметры.Номер = ВыборкаНомер.КоличествоОбращений + 1;
		
		ЗапросКлиент = Новый Запрос;
		ЗапросКлиент.УстановитьПараметр("Клиент",СсылкаНаОбъект.Клиент);
		ЗапросКлиент.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Клиенты.Фамилия,
		|	Клиенты.Имя,
		|	Клиенты.Отчество,
		|	Клиенты.Пол,
		|	Клиенты.ДатаРождения,
		|	Клиенты.СНИЛС КАК СНИЛС,
		|	Клиенты.умцМестоРаботы КАК МестоРаботы1,
		|	Клиенты.умцМестоРаботыДополнительное КАК МестоРаботы2,
		|	Клиенты.умцМестоРаботы.НаименованиеПолное КАК умцМестоРаботы1НаименованиеПолное
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты
		|ГДЕ
		|	Клиенты.Ссылка = &Клиент"
		;
		ВыборкаКлиент = ЗапросКлиент.Выполнить().Выбрать();
		ВыборкаКлиент.Следующий();  
		
		ОбластьДокумент.Параметры.Фамилия	 = СокрЛП(ВыборкаКлиент.Фамилия);
		ОбластьДокумент.Параметры.Имя 	  	 = СокрЛП(ВыборкаКлиент.Имя);
		ОбластьДокумент.Параметры.Отчество	 = СокрЛП(ВыборкаКлиент.Отчество); 	
		
		Если ЗначениеЗаполнено(ВыборкаКлиент.ДатаРождения) Тогда 
			ОбластьДокумент.Параметры.ДатаРождения = Формат(ВыборкаКлиент.ДатаРождения,"ДФ=dd.MM.yyyy");
			ОбластьДокумент.Параметры.Возраст = ОбщегоНазначенияКлиентСервер.ПолучитьВозрастСтрокой(ВыборкаКлиент.ДатаРождения);
		КонецЕсли;
		
		ОбластьДокумент.Параметры.Пол = ?(ВыборкаКлиент.Пол=Перечисления.ПолФизическихЛиц.НеУказан,"",ВыборкаКлиент.Пол);
		
		Если ЗначениеЗаполнено(ВыборкаКлиент.СНИЛС) Тогда
			ОбщегоНазначения.ЗаполнитьПараметрПосимвольно(ОбластьДокумент,"СНИЛС", ВыборкаКлиент.СНИЛС);
		КонецЕсли;

		Если ЗначениеЗаполнено(СсылкаНаОбъект.ДатаВремяПоступления) Тогда 
			ОбластьДокумент.Параметры.ДатаВремяПоступления = Формат(СсылкаНаОбъект.ДатаВремяПоступления,"ДФ='dd.MM.yyyy HH:mm'");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(СсылкаНаОбъект.ДатаВремяОтказа) Тогда 
			ОбластьДокумент.Параметры.ДатаВремяОтказа = Формат(СсылкаНаОбъект.ДатаВремяОтказа,"ДФ='dd.MM.yyyy HH:mm'");
		КонецЕсли;
		
		ОбластьДокумент.Параметры.ДиагнозНаправления    	   = СсылкаНаОбъект.ДиагнозНаправления;
		ОбластьДокумент.Параметры.ДиагнозПоступления		   = СсылкаНаОбъект.ДиагнозПоступления;
		ОбластьДокумент.Параметры.ПринятыеМеры  			   = СсылкаНаОбъект.ПринятыеМеры;
		ОбластьДокумент.Параметры.Рекомендации  			   = СсылкаНаОбъект.Рекомендации;
		ОбластьДокумент.Параметры.ПричинаОтказаВГоспитализации = СсылкаНаОбъект.ПричинаОтказаВГоспитализации;
		
		ОбластьДокумент.Параметры.Ответственный = ОбщегоНазначения.ФамилияИнициалыФизЛица(СсылкаНаОбъект.Ответственный.Сотрудник);		
		ТабДокумент.Вывести(ОбластьДокумент);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Отказ в госпитализации не распечатан, потому что документе не отмечен как отказ.'"));
	КонецЕсли;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
		
КонецФункции

Функция ПечатьВыпискаИзМедкарты(СсылкаНаОбъект) Экспорт
	
	Если Ложь Тогда СсылкаНаОбъект = Документы.ОбращениеВСтационар.ПустаяСсылка() КонецЕсли;
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ВыпискаИзМедкарты");
	ОбластьЛист1 = Макет.ПолучитьОбласть("Лист1");
	
	//Данные организации
	СтруктураРеквизитовОрганизации = ПроцедурыСпециализацииПоставки.ПолучитьРеквизитыОрганизации(СсылкаНаОбъект); 
	Если ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.НазваниеОрганизации) Тогда
		ОбластьЛист1.Параметры.ПредставлениеОрганизации = СтруктураРеквизитовОрганизации.НазваниеОрганизации;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.ОКПО) Тогда
		ОбщегоНазначения.ЗаполнитьПараметрПосимвольно(ОбластьЛист1,"ОКПО", СтруктураРеквизитовОрганизации.ОКПО);
	КонецЕсли;
	
	ЗапросКлиент = Новый Запрос;
	ЗапросКлиент.УстановитьПараметр("Клиент",СсылкаНаОбъект.Клиент);
	ЗапросКлиент.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Клиенты.Фамилия,
	|	Клиенты.Имя,
	|	Клиенты.Отчество,
	|	Клиенты.умцМестоРаботы КАК МестоРаботы1,
	|	Клиенты.умцМестоРаботыДополнительное КАК МестоРаботы2,
	|	Клиенты.умцМестоРаботы.НаименованиеПолное КАК умцМестоРаботы1НаименованиеПолное,
	|	Клиенты.ДатаРождения
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	Клиенты.Ссылка = &Клиент"
	;
	ВыборкаКлиент = ЗапросКлиент.Выполнить().Выбрать();
	ВыборкаКлиент.Следующий();  
	
	ОбластьЛист1.Параметры.ФИО_Пациента	 = СокрЛП(ВыборкаКлиент.Фамилия) + " " +СокрЛП(ВыборкаКлиент.Имя) + " " + СокрЛП(ВыборкаКлиент.Отчество); 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Вид В (&Вид)";
	
	МассивАдр = Новый Массив;
	МассивАдр.Добавить(Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	МассивАдр.Добавить(Справочники.ВидыКонтактнойИнформации.АдресФактический);	
	
	Запрос.УстановитьПараметр("Вид", МассивАдр);
	Запрос.УстановитьПараметр("Объект", СсылкаНаОбъект.Клиент);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьЛист1.Параметры.АдресПациента=ВыборкаДетальныеЗаписи.Представление;
	КонецЦикла;
	
	ОбластьЛист1.Параметры.МестоРаботы_РодЗанятий = ВыборкаКлиент.умцМестоРаботы1НаименованиеПолное;
	
	Если ЗначениеЗаполнено(ВыборкаКлиент.ДатаРождения) Тогда 
		ОбластьЛист1.Параметры.ДатаРождения = Формат(ВыборкаКлиент.ДатаРождения,"ДФ=dd.MM.yyyy");
	КонецЕсли;
		
	Если ЗначениеЗаполнено(СсылкаНаОбъект.ДатаВремяПоступления) Тогда 
		ОбластьЛист1.Параметры.ДатаПоступления = Формат(СсылкаНаОбъект.ДатаВремяПоступления,"ДФ=dd.MM.yyyy");
	КонецЕсли;	

	ТабДокумент.Вывести(ОбластьЛист1);

	ОбластьЛист2 = Макет.ПолучитьОбласть("Лист2");
	
	ОбластьЛист2.Параметры.Дата = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
	ОбластьЛист2.Параметры.Врач = СсылкаНаОбъект.ЛечащийВрач;
	ТабДокумент.Вывести(ОбластьЛист2);	
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ВычислитьПродолжительностьГоспитализации(Объект, ВидСтационара = Неопределено, ДатаВремяВыписки = Неопределено) Экспорт
	
	Если ВидСтационара = Неопределено Тогда 
		ВидСтационара = Перечисления.ВидыСтационара.Круглосуточный;	
	КонецЕсли;
	ПродолжительностьГоспитализации = 0;
	
	Если ДатаВремяВыписки = Неопределено Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	КлиентыСтационараСрезПоследних.ДатаНачала КАК ДатаВремяВыписки
		               |ИЗ
		               |	РегистрСведений.КлиентыСтационара.СрезПоследних КАК КлиентыСтационараСрезПоследних
		               |ГДЕ
		               |	КлиентыСтационараСрезПоследних.ДокументПоступления.ДокументОбращения = &ДокументОбращения
		               |	И КлиентыСтационараСрезПоследних.Выписан";
		
		Запрос.УстановитьПараметр("ДокументОбращения", Объект);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			ДатаВремяВыписки = Выборка.ДатаВремяВыписки;
		КонецЕсли;
	КонецЕсли;
	
	ДатаПоступления = ?(ЗначениеЗаполнено(Объект.ДатаВремяГоспитализации), Объект.ДатаВремяГоспитализации, Объект.ДатаВремяПоступления);
	Если ЗначениеЗаполнено(ДатаПоступления)
		И ДатаВремяВыписки <> Неопределено 
		И ДатаПоступления <= ДатаВремяВыписки				
	Тогда
		ПродолжительностьГоспитализации = Окр((НачалоДня(ДатаВремяВыписки) - НачалоДня(ДатаПоступления))/86400);  		 								
		Если ВидСтационара <> Перечисления.ВидыСтационара.Круглосуточный
			Или ПродолжительностьГоспитализации = 0 
		Тогда 
			ПродолжительностьГоспитализации = ПродолжительностьГоспитализации + 1;	
		КонецЕсли;			
	КонецЕсли;	
	
	Возврат Новый Структура("ДатаВремяВыписки, ПродолжительностьГоспитализации", ДатаВремяВыписки, ПродолжительностьГоспитализации);
	
КонецФункции

Функция ПечатьОтказПациентаОтГоспитализации(СсылкаНаОбъект) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ОтказПациентаОтГоспитализации");
	ОбластьДокумент = Макет.ПолучитьОбласть("ОтказПациентаОтГоспитализации");
	
	Если СсылкаНаОбъект.ОтказВГоспитализации Тогда
		
		ОбластьДокумент.Параметры.НаименованиеЛПУПолное = СсылкаНаОбъект.Филиал.НазваниеОрганизации;
		ОбластьДокумент.Параметры.ФИОПациентаДатаРождения = Строка(СсылкаНаОбъект.Клиент) + ", " + Формат(СсылкаНаОбъект.Клиент.ДатаРождения,"ДФ=dd.MM.yyyy");
		ОбластьДокумент.Параметры.НаименованиеЛПУ = СсылкаНаОбъект.Филиал.НазваниеОрганизации;
		ОбластьДокумент.Параметры.ФИОПредставителя = СсылкаНаОбъект.ОтказЗаконныйПредставитель;
		ОбластьДокумент.Параметры.ДатаОтказа = Формат(СсылкаНаОбъект.ДатаВремяОтказа,"ДФ=dd.MM.yyyy");
		ОбластьДокумент.Параметры.ФИОВрача = СсылкаНаОбъект.СотрудникЗафиксировавшийОтказ;
		
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьДокумент);
	
	Возврат ТабДокумент;
	
КонецФункции
